list_1 = ["Igor", "Vlad", "Dima", "Andrei"]
# 1. Напечатать только те имена которые начинаются с буквы "A"
# 2. Напечатать каждое второе имя
# 3. Напечатать индекс имени "Dima"
print(len(list_1[::-2]))
# 4. Напечатать первое имя в списке
print(list_1[:1])
# 5. Напечатать последнее имя в списке
print(list_1[3:])
# 6. Напечатать все имена попорядку
print(list_1[:])
# 7. Напечатать все именя в обратном порядке
list_1.reverse()
# 8. Напечатать длинну списка
range(len(list_1))
range(0, 4)
# 9. Напечатать индекс последнего имени
print(len(list_1[::-1]))
