list_1 = ["Igor", "Vlad", "Dima", "Andrei"]
# 1. Напечатать только те имена которые начинаются с буквы "A"
# 2. Напечатать каждое второе имя
# 3. Напечатать индекс имени "Dima"
# 4. Напечатать первое имя в списке
# 5. Напечатать последнее имя в списке
# 6. Напечатать все имена попорядку
list_1 = ["Igor", "Vlad", "Dima", "Andrei"]
data = len(list_1)
for i in range(0, data):
   print(data[i])
# 7. Напечатать все именя в обратном порядке
# 8. Напечатать длинну списка
range(len(list_1))
range(0, 4)
# 9. Напечатать индекс последнего имени
